tutorials/multiphase/multiphaseEulerFoam/laminar/damBreak4phase/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (water oil mercury air);

water
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha 1e-3;
}

oil
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha 1e-3;
}

mercury
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha 1e-3;
}

air
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d              3e-3;
    }

    residualAlpha 1e-3;
}

blending
{
    default
    {
        type                            none;
        continuousPhase                 none;
    }
}

surfaceTension
(
    (air and water)
    {
        type            constant;
        sigma           0.07;
    }

    (air and oil)
    {
        type            constant;
        sigma           0.032;
    }

    (air and mercury)
    {
        type            constant;
        sigma           0.486;
    }

    (water and oil)
    {
        type            constant;
        sigma           0.03;
    }

    (water and mercury)
    {
        type            constant;
        sigma           0.415;
    }

    (oil and mercury)
    {
        type            constant;
        sigma           0.4;
    }
);

interfaceCompression
(
    (air and water)     1
    (air and oil)       1
    (air and mercury)   1
    (water and oil)     1
    (water and mercury) 1
    (oil and mercury)   1
);

aspectRatio
();

drag
(
    (air and water)
    {
        type            segregated;

        m               0.1;
        n               8;
    }

    (air and oil)
    {
        type            segregated;

        m               0.1;
        n               8;
    }

    (air and mercury)
    {
        type            segregated;

        m               0.1;
        n               8;
    }

    (water and oil)
    {
        type            segregated;

        m               0.1;
        n               8;
    }

    (water and mercury)
    {
        type            segregated;

        m               0.1;
        n               8;
    }

    (oil and mercury)
    {
        type            segregated;

        m               0.1;
        n               8;
    }
);

virtualMass
();

heatTransfer
();

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
();

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
